package tasks;

public class ChocolateBar {
    /**
     Твоя задача - розділити шоколадку заданого розміру n x m на маленькі квадратики.
     Кожен квадрат має розмір 1 x 1 і його не можна розломити.
     Реалізуй метод breakChocolate(), який буде повертати мінімальну кількість необхідних розломів.
     Вхідними даними завжди будуть цілі невід'ємні числа.
     Наприклад, якщо дана шоколадка розміром 2 x 1,
     ти можеш розділити її на квадратики за один розлом, але розмір 3 x 1 необхідно розломити двічі.
     Якщо вхідні дані недійсні, поверни 0.
     */
    public static int breakChocolate(int n, int m) {
        if (n == 0 && m == 0) {
            return 0;
        }
        int breakCounter = (n * m) - 1;
        return breakCounter;
    }
}
