package tasks;

public class DoubleCola {
    /**
     * Аліса, Боб, Чарлі та Девід стоять у черзі до автомату, що продає напій 'Double Cola'. Перша в черзі (Аліса)
     * купує банку, випиває її та подвоюється! Після цього дві Аліси переходять в кінець черги. Потім наступний в черзі
     * (Боб) купує банку, випиває її, і в кінець черги стають вже два Боби.
     * Реалізуй метод getName, який приймає непорожній масив рядків names,
     * що містить імена людей в черзі, та додатне ціле число n. Метод повинен повернути ім'я людини,
     * яка п'є n-ну банку Коли.
     * Банки Коли нумеруються, починаючи з 1.
     */
    public static String getNthPerson(String[] names, int n) {
        int queue = names.length;
        int copies = 1;
        while (n > queue * copies) {
            n -= queue * copies;
            copies *= 2;
        }
        return names[(n - 1) / copies];
    }
}
